odip.opendatasupport.eu/mapping_queries/it.org
#+TITLE: ODS Italy
#+OPTIONS: toc:2          (only to two levels in TOC)
#+TODO: TODO(t) WAIT(w@/!) | STARTED(s) | DONE(d!) CANCELED(c@)
#+DRAWERS: HIDDEN PROPERTIES STATE

