odip.opendatasupport.eu/mapping_queries/it.org
* Introduction

   - http://192.168.33.33/lodms
   - http://192.168.33.33/sparql

To get the predicates accessible:

#+NAME: sparqlend_predicates
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX dct:<http://purl.org/dc/terms/> 
SELECT DISTINCT ?p
FROM <http://www.dati.gov.it/catalog/>
where { 
 ?ds a <http://www.w3.org/ns/dcat#Dataset> .
 ?ds ?p ?o 
} ORDER BY ?p
#+end_src

#+RESULTS: sparqlend_predicates
| p                                                                      |
| http://data.opendatasupport.eu/ontology/harmonisation.owl#content_hash |
| http://data.opendatasupport.eu/ontology/harmonisation.owl#harvest_date |
| http://www.dati.gov.it/catalog/predicate/author                        |
| http://www.dati.gov.it/catalog/predicate/author_email                  |
| http://www.dati.gov.it/catalog/predicate/extras                        |
| http://www.dati.gov.it/catalog/predicate/id                            |
| http://www.dati.gov.it/catalog/predicate/isopen                        |
| http://www.dati.gov.it/catalog/predicate/license_id                    |
| http://www.dati.gov.it/catalog/predicate/license_title                 |
| http://www.dati.gov.it/catalog/predicate/license_url                   |
| http://www.dati.gov.it/catalog/predicate/maintainer                    |
| http://www.dati.gov.it/catalog/predicate/maintainer_email              |
| http://www.dati.gov.it/catalog/predicate/metadata_created              |
| http://www.dati.gov.it/catalog/predicate/metadata_modified             |
| http://www.dati.gov.it/catalog/predicate/name                          |
| http://www.dati.gov.it/catalog/predicate/notes                         |
| http://www.dati.gov.it/catalog/predicate/num_resources                 |
| http://www.dati.gov.it/catalog/predicate/num_tags                      |
| http://www.dati.gov.it/catalog/predicate/owner_org                     |
| http://www.dati.gov.it/catalog/predicate/private                       |
| http://www.dati.gov.it/catalog/predicate/resources                     |
| http://www.dati.gov.it/catalog/predicate/revision_id                   |
| http://www.dati.gov.it/catalog/predicate/revision_timestamp            |
| http://www.dati.gov.it/catalog/predicate/state                         |
| http://www.dati.gov.it/catalog/predicate/tags                          |
| http://www.dati.gov.it/catalog/predicate/title                         |
| http://www.dati.gov.it/catalog/predicate/type                          |
| http://www.dati.gov.it/catalog/predicate/url                           |
| http://www.dati.gov.it/catalog/predicate/version                       |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type                        |

#+NAME: sparqlend_extra
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct:<http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?p
FROM <http://www.dati.gov.it/catalog/>
where { 
?ds a <http://www.w3.org/ns/dcat#Dataset> .
{ { ?ds ?p ?o . } UNION { ?a ?p ?ds . } } 
} ORDER BY ?p
#+end_src

#+RESULTS: sparqlend_extra 
| p                                                                      |
| http://data.opendatasupport.eu/ontology/harmonisation.owl#content_hash |
| http://data.opendatasupport.eu/ontology/harmonisation.owl#harvest_date |
| http://www.dati.gov.it/catalog/predicate/author                        |
| http://www.dati.gov.it/catalog/predicate/author_email                  |
| http://www.dati.gov.it/catalog/predicate/extras                        |
| http://www.dati.gov.it/catalog/predicate/id                            |
| http://www.dati.gov.it/catalog/predicate/isopen                        |
| http://www.dati.gov.it/catalog/predicate/license_id                    |
| http://www.dati.gov.it/catalog/predicate/license_title                 |
| http://www.dati.gov.it/catalog/predicate/license_url                   |
| http://www.dati.gov.it/catalog/predicate/maintainer                    |
| http://www.dati.gov.it/catalog/predicate/maintainer_email              |
| http://www.dati.gov.it/catalog/predicate/metadata_created              |
| http://www.dati.gov.it/catalog/predicate/metadata_modified             |
| http://www.dati.gov.it/catalog/predicate/name                          |
| http://www.dati.gov.it/catalog/predicate/notes                         |
| http://www.dati.gov.it/catalog/predicate/num_resources                 |
| http://www.dati.gov.it/catalog/predicate/num_tags                      |
| http://www.dati.gov.it/catalog/predicate/owner_org                     |
| http://www.dati.gov.it/catalog/predicate/private                       |
| http://www.dati.gov.it/catalog/predicate/resources                     |
| http://www.dati.gov.it/catalog/predicate/revision_id                   |
| http://www.dati.gov.it/catalog/predicate/revision_timestamp            |
| http://www.dati.gov.it/catalog/predicate/state                         |
| http://www.dati.gov.it/catalog/predicate/tags                          |
| http://www.dati.gov.it/catalog/predicate/title                         |
| http://www.dati.gov.it/catalog/predicate/type                          |
| http://www.dati.gov.it/catalog/predicate/url                           |
| http://www.dati.gov.it/catalog/predicate/version                       |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type                        |
| http://www.w3.org/ns/dcat#dataset                                      |

#+NAME: sparqlend_id
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?dist ?url
WHERE {
  ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
  ?ds orig:resources  ?resource. 
  ?resource orig:id ?id.
  ?resource orig:url  ?url. 
  BIND(CONCAT(STR(?ds),"/distributions/") AS ?hds).
  BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
} LIMIT 10
#+end_src

To get the extra keys:

#+NAME: sparqlend_key_value
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?key
WHERE {
  ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
  ?ds orig:extras ?ex . 
  ?ex orig:key ?key .
} ORDER BY ?key LIMIT 1000
#+end_src

#+RESULTS: sparqlend_key_value
| key                      |                |                  |                |              |                  |          |        |
| Aggiornamento            |                |                  |                |              |                  |          |        |
| Aggiornamento            | dati           |                  |                |              |                  |          |        |
| Categorie                |                |                  |                |              |                  |          |        |
| Codifica                 | Caratteri      |                  |                |              |                  |          |        |
| Copertura                | Geografica     |                  |                |              |                  |          |        |
| Copertura                | Temporale      | (Data            | di             | fine)        |                  |          |        |
| Copertura                | Temporale      | (Data            | di             | inizio)      |                  |          |        |
| Data                     | di             | aggiornamento    |                |              |                  |          |        |
| Data                     | di             | creazione        |                |              |                  |          |        |
| Data                     | di             | pubblicazione    |                |              |                  |          |        |
| Data                     | ultima         | modifica         | del            | dato         |                  |          |        |
| Data                     | ultima         | modifica         | del            | metadato     |                  |          |        |
| Data                     | ultima         | modifica         | del            | metadato     |                  |          |        |
| Dati                     | Ufficiali      | ISTAT            |                |              |                  |          |        |
| Descrizione              | campi          |                  |                |              |                  |          |        |
| ELABORATED_TAGS          |                |                  |                |              |                  |          |        |
| Estensione:              | Localizzazione | Geografica:      | Latitudine     | Nord         |                  |          |        |
| Estensione:              | Localizzazione | Geografica:      | Latitudine     | Sud          |                  |          |        |
| Estensione:              | Localizzazione | Geografica:      | Longitudine    | Est          |                  |          |        |
| Estensione:              | Localizzazione | Geografica:      | Longitudine    | Ovest        |                  |          |        |
| ISTAT                    |                |                  |                |              |                  |          |        |
| Informazioni             | Sulla          | Distribuzione:   | Nome           | formato      |                  |          |        |
| Informazioni             | Sulla          | Distribuzione:   | Versione       | formato      |                  |          |        |
| Informazioni             | di             | Identificatione: | Punto          | di           | Contatto:        | E-mail   |        |
| Ente                     |                |                  |                |              |                  |          |        |
| Informazioni             | di             | Identificatione: | Punto          | di           | Contatto:        | Ruolo    |        |
| Informazioni             | di             | Identificatione: | Punto          | di           | Contatto:        | Telefono |        |
| Informazioni             | di             | Identificazione: | Altri          | vincoli      |                  |          |        |
| Informazioni             | di             | Identificazione: | Codice         |              |                  |          |        |
| Informazioni             | di             | Identificazione: | Descrizione    |              |                  |          |        |
| Informazioni             | di             | Identificazione: | E-mail         |              |                  |          |        |
| Informazioni             | di             | Identificazione: | Formato        | di           | presentazione    |          |        |
| Informazioni             | di             | Identificazione: | Identificatore |              |                  |          |        |
| uso                      |                |                  |                |              |                  |          |        |
| Informazioni             | di             | Identificazione: | Lingua         |              |                  |          |        |
| Ente                     |                |                  |                |              |                  |          |        |
| Informazioni             | di             | Identificazione: | Parole         | chiave       |                  |          |        |
| Informazioni             | di             | Identificazione: | Risorsa        | Online       |                  |          |        |
| Informazioni             | di             | Identificazione: | Ruolo          |              |                  |          |        |
| Informazioni             | di             | Identificazione: | Scala          | Equivalente: | Denominatore     |          |        |
| Informazioni             | di             | Identificazione: | Telefono       |              |                  |          |        |
| Informazioni             | di             | Identificazione: | Tema           |              |                  |          |        |
| Informazioni             | di             | Identificazione: | Tipo           | data         |                  |          |        |
| Informazioni             | di             | Identificazione: | Tipo           | di           | rappresentazione | spaziale |        |
| Informazioni             | di             | Identificazione: | Titolo         |              |                  |          |        |
| Informazioni             | di             | Identificazione: | Vincoli        | di           | accesso          |          |        |
| '                        |                |                  |                |              |                  |          |        |
| Informazioni             | sul            | Sistema          | di             | Riferimento: | Codice           |          |        |
| Informazioni             | sulla          | Distribuzione:   | Distributore:  | E-mail       |                  |          |        |
| Ente                     |                |                  |                |              |                  |          |        |
| Informazioni             | sulla          | Distribuzione:   | Distributore:  | Risorsa      | Online           |          |        |
| Informazioni             | sulla          | Distribuzione:   | Distributore:  | Ruolo        |                  |          |        |
| Informazioni             | sulla          | Distribuzione:   | Distributore:  | Telefono     |                  |          |        |
| Informazioni             | sulla          | Distribuzione:   | Opzioni        | di           | Trasferimento:   | Risorsa  | Online |
| '                        |                |                  |                |              |                  |          |        |
| dei                      | Dati:          | Data             |                |              |                  |          |        |
| dei                      | Dati:          | Identificatore   |                |              |                  |          |        |
| competente               |                |                  |                |              |                  |          |        |
| dei                      | Dati:          | Identificatore:  | Identificatore |              |                  |          |        |
| dei                      | Dati:          | Livello          |                |              |                  |          |        |
| dei                      | Dati:          | Processo         | di             | produzione   |                  |          |        |
| dei                      | Dati:          | Registrazione    |                |              |                  |          |        |
| dei                      | Dati:          | Spiegazione      |                |              |                  |          |        |
| dei                      | Dati:          | Tipo             | data           |              |                  |          |        |
| dei                      | Dati:          | Titolo           |                |              |                  |          |        |
| dei                      | Dati:          | xlink:href       |                |              |                  |          |        |
| Metadato:                | Contatto:      | E-mail           |                |              |                  |          |        |
| Ente                     |                |                  |                |              |                  |          |        |
| Metadato:                | Contatto:      | Risorsa          | Online         |              |                  |          |        |
| Metadato:                | Contatto:      | Ruolo            |                |              |                  |          |        |
| Metadato:                | Contatto:      | Telefono         |                |              |                  |          |        |
| Metadato:                | Data           | dei              | metadati       |              |                  |          |        |
| Metadato:                | Identificatore | del              | file           | dei          | metadati         |          |        |
| Metadato:                | Identificatore | del              | file           | precedente   | di               | metadato |        |
| Metadato:                | Lingua         |                  |                |              |                  |          |        |
| Metadato:                | Livello        | gerarchico       |                |              |                  |          |        |
| Metadato:                | Nome           | dello            | standard       | dei          | metadati         |          |        |
| Metadato:                | Set            | dei              | caratteri      | dei          | metadati         |          |        |
| Metadato:                | Versione       | dello            | Standard       | dei          | metadati         |          |        |
| ORIGINAL_TAGS            |                |                  |                |              |                  |          |        |
| Refresh                  | rate           |                  |                |              |                  |          |        |
| Stato                    | Civile         |                  |                |              |                  |          |        |
| Tipo                     | di             | dato             |                |              |                  |          |        |
| Titolare                 |                |                  |                |              |                  |          |        |
| URL                      | sito           |                  |                |              |                  |          |        |
| Versione                 |                |                  |                |              |                  |          |        |
| author                   |                |                  |                |              |                  |          |        |
| base-url                 |                |                  |                |              |                  |          |        |
| catalog-email            |                |                  |                |              |                  |          |        |
| catalog-name             |                |                  |                |              |                  |          |        |
| catalog-url              |                |                  |                |              |                  |          |        |
| description              |                |                  |                |              |                  |          |        |
| geo-name                 |                |                  |                |              |                  |          |        |
| geo-type                 |                |                  |                |              |                  |          |        |
| groups                   |                |                  |                |              |                  |          |        |
| harvest_url              |                |                  |                |              |                  |          |        |
| hidden_field             |                |                  |                |              |                  |          |        |
| license_id               |                |                  |                |              |                  |          |        |
| maintainer               |                |                  |                |              |                  |          |        |
| metadata_created         |                |                  |                |              |                  |          |        |
| metadata_modified        |                |                  |                |              |                  |          |        |
| metadata_source_modified |                |                  |                |              |                  |          |        |
| new_extra                |                |                  |                |              |                  |          |        |
| package_created          |                |                  |                |              |                  |          |        |
| package_id               |                |                  |                |              |                  |          |        |
| package_modified         |                |                  |                |              |                  |          |        |
| package_type             |                |                  |                |              |                  |          |        |
| reference_system         |                |                  |                |              |                  |          |        |
| scale                    |                |                  |                |              |                  |          |        |
| source                   |                |                  |                |              |                  |          |        |
| spc-ref                  |                |                  |                |              |                  |          |        |
| tag                      |                |                  |                |              |                  |          |        |
| tag-aggiuntivi           |                |                  |                |              |                  |          |        |
| tag-originali            |                |                  |                |              |                  |          |        |
| title                    |                |                  |                |              |                  |          |        |
| topic                    |                |                  |                |              |                  |          |        |
| ultimo-aggiornamento     |                |                  |                |              |                  |          |        |
| update_rate              |                |                  |                |              |                  |          |        |
| url                      |                |                  |                |              |                  |          |        |
| valid_to                 |                |                  |                |              |                  |          |        |
| visualization_url        |                |                  |                |              |                  |          |        |

The list of acceptable file types can be accessed at: http://publications.europa.eu/resource/authority/file-type


#+NAME: sparqlend_select_concept
#+begin_src roqet :endpoint http://192.168.33.33/sparql
select distinct ?concept
FROM <http://publications.europa.eu/resource/authority/file-type>
WHERE {
  ?concept a <http://www.w3.org/2004/02/skos/core#Concept>
} ORDER BY ?concept
#+end_src

#+RESULTS: sparqlend_select_concept
| concept                                                               |
| http://publications.europa.eu/resource/authority/file-type/AZW        |
| http://publications.europa.eu/resource/authority/file-type/CSV        |
| http://publications.europa.eu/resource/authority/file-type/DBF        |
| http://publications.europa.eu/resource/authority/file-type/DOC        |
| http://publications.europa.eu/resource/authority/file-type/DOCX       |
| http://publications.europa.eu/resource/authority/file-type/E00        |
| http://publications.europa.eu/resource/authority/file-type/EPUB       |
| http://publications.europa.eu/resource/authority/file-type/FMX2       |
| http://publications.europa.eu/resource/authority/file-type/FMX3       |
| http://publications.europa.eu/resource/authority/file-type/FMX4       |
| http://publications.europa.eu/resource/authority/file-type/GIF        |
| http://publications.europa.eu/resource/authority/file-type/GZIP       |
| http://publications.europa.eu/resource/authority/file-type/HTML       |
| http://publications.europa.eu/resource/authority/file-type/JPEG       |
| http://publications.europa.eu/resource/authority/file-type/JSON       |
| http://publications.europa.eu/resource/authority/file-type/KML        |
| http://publications.europa.eu/resource/authority/file-type/MDB        |
| http://publications.europa.eu/resource/authority/file-type/MOBI       |
| http://publications.europa.eu/resource/authority/file-type/MOP        |
| http://publications.europa.eu/resource/authority/file-type/MXD        |
| http://publications.europa.eu/resource/authority/file-type/OP_DATPRO  |
| http://publications.europa.eu/resource/authority/file-type/PDF        |
| http://publications.europa.eu/resource/authority/file-type/PDFA1A     |
| http://publications.europa.eu/resource/authority/file-type/PDFA1B     |
| http://publications.europa.eu/resource/authority/file-type/PDFX       |
| http://publications.europa.eu/resource/authority/file-type/PNG        |
| http://publications.europa.eu/resource/authority/file-type/PPSX       |
| http://publications.europa.eu/resource/authority/file-type/PPT        |
| http://publications.europa.eu/resource/authority/file-type/PPTX       |
| http://publications.europa.eu/resource/authority/file-type/RDF_XML    |
| http://publications.europa.eu/resource/authority/file-type/RTF        |
| http://publications.europa.eu/resource/authority/file-type/SGML       |
| http://publications.europa.eu/resource/authority/file-type/SKOS_XML   |
| http://publications.europa.eu/resource/authority/file-type/SPARQLQ    |
| http://publications.europa.eu/resource/authority/file-type/SPARQLQRES |
| http://publications.europa.eu/resource/authority/file-type/TIFF       |
| http://publications.europa.eu/resource/authority/file-type/TSV        |
| http://publications.europa.eu/resource/authority/file-type/TXT        |
| http://publications.europa.eu/resource/authority/file-type/XHTML      |
| http://publications.europa.eu/resource/authority/file-type/XLS        |
| http://publications.europa.eu/resource/authority/file-type/XLSX       |
| http://publications.europa.eu/resource/authority/file-type/XML        |
| http://publications.europa.eu/resource/authority/file-type/XSLT       |
| http://publications.europa.eu/resource/authority/file-type/ZIP        |

