odip.opendatasupport.eu/mapping_queries/it.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ODS Italy</title>
<!-- 2013-12-19 Thu 16:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Paul Massey" />
</head>
<body>
<div id="content">
<h1 class="title">ODS Italy</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Recommended</a>
<ul>
<li><a href="#sec-2-1">distribution title</a></li>
<li><a href="#sec-2-2">distribution description</a></li>
<li><a href="#sec-2-3">distribution format</a></li>
<li><a href="#sec-2-4">distribution accessURL</a></li>
<li><a href="#sec-2-5">distribution license</a></li>
</ul>
</li>
<li><a href="#sec-3">Optional</a>
<ul>
<li><a href="#sec-3-1">byte size</a></li>
<li><a href="#sec-3-2">download URL</a></li>
<li><a href="#sec-3-3">media type</a></li>
<li><a href="#sec-3-4">release date</a></li>
<li><a href="#sec-3-5">modification date</a></li>
<li><a href="#sec-3-6">rights</a></li>
<li><a href="#sec-3-7">status</a></li>
<li><a href="#sec-3-8">title</a></li>
</ul>
</li>
<li><a href="#sec-4">Dataset properties</a>
<ul>
<li><a href="#sec-4-1">Mandatory</a></li>
<li><a href="#sec-4-2">Recommended</a></li>
<li><a href="#sec-4-3">Optional</a></li>
</ul>
</li>
<li><a href="#sec-5">Value Mapping</a></li>
<li><a href="#sec-6">Outstanding Tasks</a>
<ul>
<li><a href="#sec-6-1"><span class="done STARTED">STARTED</span> distribution accessURL not present</a></li>
<li><a href="#sec-6-2">Value Mapping</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://192.168.33.33/lodms">http://192.168.33.33/lodms</a>
</li>
<li><a href="http://192.168.33.33/sparql">http://192.168.33.33/sparql</a>
</li>
</ul>

<p>
To get the predicates accessible:
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_predicates">PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?p
FROM &lt;http://www.dati.gov.it/catalog/&gt;
where { 
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; .
 ?ds ?p ?o 
} ORDER BY ?p
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">p</td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/ontology/harmonisation.owl#content_hash">http://data.opendatasupport.eu/ontology/harmonisation.owl#content_hash</a></td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/ontology/harmonisation.owl#harvest_date">http://data.opendatasupport.eu/ontology/harmonisation.owl#harvest_date</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/author">http://www.dati.gov.it/catalog/predicate/author</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/author_email">http://www.dati.gov.it/catalog/predicate/author_email</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/extras">http://www.dati.gov.it/catalog/predicate/extras</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/id">http://www.dati.gov.it/catalog/predicate/id</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/isopen">http://www.dati.gov.it/catalog/predicate/isopen</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/license_id">http://www.dati.gov.it/catalog/predicate/license_id</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/license_title">http://www.dati.gov.it/catalog/predicate/license_title</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/license_url">http://www.dati.gov.it/catalog/predicate/license_url</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/maintainer">http://www.dati.gov.it/catalog/predicate/maintainer</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/maintainer_email">http://www.dati.gov.it/catalog/predicate/maintainer_email</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/metadata_created">http://www.dati.gov.it/catalog/predicate/metadata_created</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/metadata_modified">http://www.dati.gov.it/catalog/predicate/metadata_modified</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/name">http://www.dati.gov.it/catalog/predicate/name</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/notes">http://www.dati.gov.it/catalog/predicate/notes</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/num_resources">http://www.dati.gov.it/catalog/predicate/num_resources</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/num_tags">http://www.dati.gov.it/catalog/predicate/num_tags</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/owner_org">http://www.dati.gov.it/catalog/predicate/owner_org</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/private">http://www.dati.gov.it/catalog/predicate/private</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/resources">http://www.dati.gov.it/catalog/predicate/resources</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/revision_id">http://www.dati.gov.it/catalog/predicate/revision_id</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/revision_timestamp">http://www.dati.gov.it/catalog/predicate/revision_timestamp</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/state">http://www.dati.gov.it/catalog/predicate/state</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/tags">http://www.dati.gov.it/catalog/predicate/tags</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/title">http://www.dati.gov.it/catalog/predicate/title</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/type">http://www.dati.gov.it/catalog/predicate/type</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/url">http://www.dati.gov.it/catalog/predicate/url</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/version">http://www.dati.gov.it/catalog/predicate/version</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/1999/02/22-rdf-syntax-ns#type">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_extra">PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
SELECT DISTINCT ?p
FROM &lt;http://www.dati.gov.it/catalog/&gt;
where { 
?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; .
{ { ?ds ?p ?o . } UNION { ?a ?p ?ds . } } 
} ORDER BY ?p
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">p</td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/ontology/harmonisation.owl#content_hash">http://data.opendatasupport.eu/ontology/harmonisation.owl#content_hash</a></td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/ontology/harmonisation.owl#harvest_date">http://data.opendatasupport.eu/ontology/harmonisation.owl#harvest_date</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/author">http://www.dati.gov.it/catalog/predicate/author</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/author_email">http://www.dati.gov.it/catalog/predicate/author_email</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/extras">http://www.dati.gov.it/catalog/predicate/extras</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/id">http://www.dati.gov.it/catalog/predicate/id</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/isopen">http://www.dati.gov.it/catalog/predicate/isopen</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/license_id">http://www.dati.gov.it/catalog/predicate/license_id</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/license_title">http://www.dati.gov.it/catalog/predicate/license_title</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/license_url">http://www.dati.gov.it/catalog/predicate/license_url</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/maintainer">http://www.dati.gov.it/catalog/predicate/maintainer</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/maintainer_email">http://www.dati.gov.it/catalog/predicate/maintainer_email</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/metadata_created">http://www.dati.gov.it/catalog/predicate/metadata_created</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/metadata_modified">http://www.dati.gov.it/catalog/predicate/metadata_modified</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/name">http://www.dati.gov.it/catalog/predicate/name</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/notes">http://www.dati.gov.it/catalog/predicate/notes</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/num_resources">http://www.dati.gov.it/catalog/predicate/num_resources</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/num_tags">http://www.dati.gov.it/catalog/predicate/num_tags</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/owner_org">http://www.dati.gov.it/catalog/predicate/owner_org</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/private">http://www.dati.gov.it/catalog/predicate/private</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/resources">http://www.dati.gov.it/catalog/predicate/resources</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/revision_id">http://www.dati.gov.it/catalog/predicate/revision_id</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/revision_timestamp">http://www.dati.gov.it/catalog/predicate/revision_timestamp</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/state">http://www.dati.gov.it/catalog/predicate/state</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/tags">http://www.dati.gov.it/catalog/predicate/tags</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/title">http://www.dati.gov.it/catalog/predicate/title</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/type">http://www.dati.gov.it/catalog/predicate/type</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/url">http://www.dati.gov.it/catalog/predicate/url</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/predicate/version">http://www.dati.gov.it/catalog/predicate/version</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/1999/02/22-rdf-syntax-ns#type">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/dcat#dataset">http://www.w3.org/ns/dcat#dataset</a></td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_id">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
SELECT DISTINCT ?dist ?url
WHERE {
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
  ?ds orig:resources  ?resource. 
  ?resource orig:id ?id.
  ?resource orig:url  ?url. 
  BIND(CONCAT(STR(?ds),"/distributions/") AS ?hds).
  BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
} LIMIT 10
</pre>
</div>

<p>
To get the extra keys:
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_key_value">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
SELECT DISTINCT ?key
WHERE {
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
  ?ds orig:extras ?ex . 
  ?ex orig:key ?key .
} ORDER BY ?key LIMIT 1000
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">key</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Aggiornamento</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Aggiornamento</td>
<td class="left">dati</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Categorie</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Codifica</td>
<td class="left">Caratteri</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Copertura</td>
<td class="left">Geografica</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Copertura</td>
<td class="left">Temporale</td>
<td class="left">(Data</td>
<td class="left">di</td>
<td class="left">fine)</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Copertura</td>
<td class="left">Temporale</td>
<td class="left">(Data</td>
<td class="left">di</td>
<td class="left">inizio)</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Data</td>
<td class="left">di</td>
<td class="left">aggiornamento</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Data</td>
<td class="left">di</td>
<td class="left">creazione</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Data</td>
<td class="left">di</td>
<td class="left">pubblicazione</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Data</td>
<td class="left">ultima</td>
<td class="left">modifica</td>
<td class="left">del</td>
<td class="left">dato</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Data</td>
<td class="left">ultima</td>
<td class="left">modifica</td>
<td class="left">del</td>
<td class="left">metadato</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Data</td>
<td class="left">ultima</td>
<td class="left">modifica</td>
<td class="left">del</td>
<td class="left">metadato</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Dati</td>
<td class="left">Ufficiali</td>
<td class="left">ISTAT</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Descrizione</td>
<td class="left">campi</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ELABORATED<sub>TAGS</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Estensione:</td>
<td class="left">Localizzazione</td>
<td class="left">Geografica:</td>
<td class="left">Latitudine</td>
<td class="left">Nord</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Estensione:</td>
<td class="left">Localizzazione</td>
<td class="left">Geografica:</td>
<td class="left">Latitudine</td>
<td class="left">Sud</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Estensione:</td>
<td class="left">Localizzazione</td>
<td class="left">Geografica:</td>
<td class="left">Longitudine</td>
<td class="left">Est</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Estensione:</td>
<td class="left">Localizzazione</td>
<td class="left">Geografica:</td>
<td class="left">Longitudine</td>
<td class="left">Ovest</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ISTAT</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">Sulla</td>
<td class="left">Distribuzione:</td>
<td class="left">Nome</td>
<td class="left">formato</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">Sulla</td>
<td class="left">Distribuzione:</td>
<td class="left">Versione</td>
<td class="left">formato</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificatione:</td>
<td class="left">Punto</td>
<td class="left">di</td>
<td class="left">Contatto:</td>
<td class="left">E-mail</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Ente</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificatione:</td>
<td class="left">Punto</td>
<td class="left">di</td>
<td class="left">Contatto:</td>
<td class="left">Ruolo</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificatione:</td>
<td class="left">Punto</td>
<td class="left">di</td>
<td class="left">Contatto:</td>
<td class="left">Telefono</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Altri</td>
<td class="left">vincoli</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Codice</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Descrizione</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">E-mail</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Formato</td>
<td class="left">di</td>
<td class="left">presentazione</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Identificatore</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">uso</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Lingua</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Ente</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Parole</td>
<td class="left">chiave</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Risorsa</td>
<td class="left">Online</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Ruolo</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Scala</td>
<td class="left">Equivalente:</td>
<td class="left">Denominatore</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Telefono</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Tema</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Tipo</td>
<td class="left">data</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Tipo</td>
<td class="left">di</td>
<td class="left">rappresentazione</td>
<td class="left">spaziale</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Titolo</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">di</td>
<td class="left">Identificazione:</td>
<td class="left">Vincoli</td>
<td class="left">di</td>
<td class="left">accesso</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">'</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">sul</td>
<td class="left">Sistema</td>
<td class="left">di</td>
<td class="left">Riferimento:</td>
<td class="left">Codice</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">sulla</td>
<td class="left">Distribuzione:</td>
<td class="left">Distributore:</td>
<td class="left">E-mail</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Ente</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">sulla</td>
<td class="left">Distribuzione:</td>
<td class="left">Distributore:</td>
<td class="left">Risorsa</td>
<td class="left">Online</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">sulla</td>
<td class="left">Distribuzione:</td>
<td class="left">Distributore:</td>
<td class="left">Ruolo</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">sulla</td>
<td class="left">Distribuzione:</td>
<td class="left">Distributore:</td>
<td class="left">Telefono</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">sulla</td>
<td class="left">Distribuzione:</td>
<td class="left">Opzioni</td>
<td class="left">di</td>
<td class="left">Trasferimento:</td>
<td class="left">Risorsa</td>
<td class="left">Online</td>
</tr>

<tr>
<td class="left">'</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">dei</td>
<td class="left">Dati:</td>
<td class="left">Data</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">dei</td>
<td class="left">Dati:</td>
<td class="left">Identificatore</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">competente</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">dei</td>
<td class="left">Dati:</td>
<td class="left">Identificatore:</td>
<td class="left">Identificatore</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">dei</td>
<td class="left">Dati:</td>
<td class="left">Livello</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">dei</td>
<td class="left">Dati:</td>
<td class="left">Processo</td>
<td class="left">di</td>
<td class="left">produzione</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">dei</td>
<td class="left">Dati:</td>
<td class="left">Registrazione</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">dei</td>
<td class="left">Dati:</td>
<td class="left">Spiegazione</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">dei</td>
<td class="left">Dati:</td>
<td class="left">Tipo</td>
<td class="left">data</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">dei</td>
<td class="left">Dati:</td>
<td class="left">Titolo</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">dei</td>
<td class="left">Dati:</td>
<td class="left">xlink:href</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Metadato:</td>
<td class="left">Contatto:</td>
<td class="left">E-mail</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Ente</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Metadato:</td>
<td class="left">Contatto:</td>
<td class="left">Risorsa</td>
<td class="left">Online</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Metadato:</td>
<td class="left">Contatto:</td>
<td class="left">Ruolo</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Metadato:</td>
<td class="left">Contatto:</td>
<td class="left">Telefono</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Metadato:</td>
<td class="left">Data</td>
<td class="left">dei</td>
<td class="left">metadati</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Metadato:</td>
<td class="left">Identificatore</td>
<td class="left">del</td>
<td class="left">file</td>
<td class="left">dei</td>
<td class="left">metadati</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Metadato:</td>
<td class="left">Identificatore</td>
<td class="left">del</td>
<td class="left">file</td>
<td class="left">precedente</td>
<td class="left">di</td>
<td class="left">metadato</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Metadato:</td>
<td class="left">Lingua</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Metadato:</td>
<td class="left">Livello</td>
<td class="left">gerarchico</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Metadato:</td>
<td class="left">Nome</td>
<td class="left">dello</td>
<td class="left">standard</td>
<td class="left">dei</td>
<td class="left">metadati</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Metadato:</td>
<td class="left">Set</td>
<td class="left">dei</td>
<td class="left">caratteri</td>
<td class="left">dei</td>
<td class="left">metadati</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Metadato:</td>
<td class="left">Versione</td>
<td class="left">dello</td>
<td class="left">Standard</td>
<td class="left">dei</td>
<td class="left">metadati</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ORIGINAL<sub>TAGS</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Refresh</td>
<td class="left">rate</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Stato</td>
<td class="left">Civile</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Tipo</td>
<td class="left">di</td>
<td class="left">dato</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Titolare</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">URL</td>
<td class="left">sito</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Versione</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">author</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">base-url</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">catalog-email</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">catalog-name</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">catalog-url</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">description</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">geo-name</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">geo-type</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">groups</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">harvest<sub>url</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">hidden<sub>field</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">license<sub>id</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">maintainer</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">metadata<sub>created</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">metadata<sub>modified</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">metadata<sub>source</sub><sub>modified</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">new<sub>extra</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">package<sub>created</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">package<sub>id</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">package<sub>modified</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">package<sub>type</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">reference<sub>system</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">scale</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">source</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">spc-ref</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">tag</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">tag-aggiuntivi</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">tag-originali</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">title</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">topic</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ultimo-aggiornamento</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">update<sub>rate</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">url</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">valid<sub>to</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">visualization<sub>url</sub></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
The list of acceptable file types can be accessed at: <a href="http://publications.europa.eu/resource/authority/file-type">http://publications.europa.eu/resource/authority/file-type</a>
</p>


<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_select_concept">select distinct ?concept
FROM &lt;http://publications.europa.eu/resource/authority/file-type&gt;
WHERE {
  ?concept a &lt;http://www.w3.org/2004/02/skos/core#Concept&gt;
} ORDER BY ?concept
</pre>
</div>
</div>
</div>
