odip.opendatasupport.eu/mapping_queries/it.org
* Recommended
** distribution title
#+NAME: sparqlend_disttitle
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?disttitle
WHERE {
 ?ds a dcat:Distribution .
 ?ds dct:title ?disttitle
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_disttitle
| disttitle |
|      2008 |
|      2009 |
|      2010 |
|      2011 |
|      2012 |
|      2013 |
|        ía |
|        ón |
| Cantabria |
|        ón |

The INSERT statement is:
#+NAME: sparqlend_disttitle_insert
#+begin_example
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dct:title ?title
} WHERE {
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds . 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds . 
 ?ds a dcat:Dataset .
 ?ds orig:title ?title .
}
#+end_example

** distribution description

#+NAME: sparqlend_distdescription
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?resource ?dist ?distdesc
WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds orig:resources  ?resource. 
 ?resource orig:id ?id.
 ?resource orig:description  ?distdesc. 
 BIND(CONCAT(STR("XXX"),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_distdescription
| resource                                                                                          | dist                                                   | distdesc                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico/resources/0 | XXX/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | La fonte primaria delle statistiche concernenti il parco veicolare e il Pra, Pubblico Registro Automobilistico,istituto gestito dall Aci e previsto dal Codice civile a tutela dei diritti dei cittadini sugli autoveicoli.Tutte le statistiche sui veicoli confluiscono in due elaborazioni da archivioamministrativo facenti parte del Programma Statistico Nazionale - PSN -,ACI00002 ?Parco veicolare? e ACI00014 ?Mercato automobilistico: prime iscrizioni, radiazioni,e trasferimenti di proprieta dei veicoli? |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_fringe-benefit/resources/0      | XXX/distributions/e31bce22-1998-4cf1-b593-c0c691eb0c7d | Tabella con costi chilometrici e relativi valori del Fringe Benefit divisi per tipologia alimentazione veicolo                                                                                                                                                                                                                                                                                                                                                                                                         |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autoritratto/resources/0        | XXX/distributions/03df43db-153f-4b81-9089-dd7e20dba312 | file in formato ODS compressi                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autoritratto/resources/1        | XXX/distributions/e9226892-4b01-4fb1-94ff-d09a800d15d1 | Consistenza parco veicoli per regione e provincia al 31 Dicembre 2012                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-2h-2013/resources/0   | XXX/distributions/d53869c8-304f-459f-a9f5-78bc77ed5f66 | Statistiche ACI/PRA Auto Trend Luglio 2013                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-2h-2013/resources/1   | XXX/distributions/88456ec6-01bb-4cd0-876e-529f601376d9 | Statistiche ACI/PRA Auto Trend Agosto 2013                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-2h-2013/resources/2   | XXX/distributions/6877a032-460f-4260-9069-6f09be2f0ea5 | Statistiche ACI/PRA Auto Trend Settembre 2013                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-1h-2013/resources/0   | XXX/distributions/0ba702c8-5728-4584-892f-539c621970b7 | Statistiche ACI/PRA Auto Trend Gennaio 2013                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-1h-2013/resources/1   | XXX/distributions/9766a807-e8db-4bdc-ab53-a95e74de0e51 | Statistiche ACI/PRA Auto Trend Febbraio 2013                                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-1h-2013/resources/2   | XXX/distributions/7fd5facd-a90b-4e5a-8885-28253a1d3ca8 | Statistiche ACI/PRA Auto Trend Marzo 2013                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |

The INSERT statement is:

