odip.opendatasupport.eu/mapping_queries/it.html
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Recommended</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> distribution title</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_disttitle">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
SELECT DISTINCT ?disttitle
WHERE {
 ?ds a dcat:Distribution .
 ?ds dct:title ?disttitle
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>
<pre class="example">
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dct:title ?title
} WHERE {
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds . 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds . 
 ?ds a dcat:Dataset .
 ?ds orig:title ?title .
}
</pre>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> distribution description</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_distdescription">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
SELECT DISTINCT ?resource ?dist ?distdesc
WHERE {
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds orig:resources  ?resource. 
 ?resource orig:id ?id.
 ?resource orig:description  ?distdesc. 
 BIND(CONCAT(STR("XXX"),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>
</div>
</div>
