odip.opendatasupport.eu/mapping_queries/it.org
** distribution format

#+NAME: sparqlend_format
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?format
WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds <http://www.dati.gov.it/catalog/predicate/resources>  ?resource. 
 ?resource orig:id ?id .
 ?resource orig:format ?format . 
 BIND(CONCAT(STR("XXXX"),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
} ORDER BY ?format
#+end_src

#+RESULTS: sparqlend_format
| format                    |           |      |
| 7z                        |           |      |
| CSV                       |           |      |
| HTML                      |           |      |
| JSON                      |           |      |
| KML                       |           |      |
| PDF                       |           |      |
| RDF                       |           |      |
| SHAPE                     |           |      |
| TXT                       |           |      |
| XLS                       |           |      |
| XML                       |           |      |
| ZIP                       |           |      |
| altro                     |           |      |
| api/sparql                |           |      |
| asp                       |           |      |
| aspx                      |           |      |
| blender                   | v.2.49b   |      |
| cd-rom                    |           |      |
| csv-semicolon             | delimited |      |
| csv-tab                   | delimited |      |
| dbf                       |           |      |
| do                        |           |      |
| doc                       |           |      |
| dxf                       |           |      |
| geojson                   |           |      |
| gml                       |           |      |
| gpx                       |           |      |
| grid                      |           |      |
| grid                      | esri      |      |
| htm                       |           |      |
| i                         | quadranti | .dxf |
| it%2fit%2fareac%2f        |           |      |
| jpg                       |           |      |
| text/javascript           |           |      |
| kmz                       |           |      |
| n/a                       |           |      |
| n3                        |           |      |
| oai-pmh                   |           |      |
| odc                       |           |      |
| ods                       |           |      |
| ots                       |           |      |
| php                       |           |      |
| amp;username=redazioneweb |           |      |
| png                       |           |      |
| rar                       |           |      |
| rss                       |           |      |
| sbn                       |           |      |
| sbx                       |           |      |
| service                   |           |      |
| shapefile                 |           |      |
| shp                       |           |      |
| shtml                     |           |      |
| shx                       |           |      |
| tsv                       |           |      |
| turtle                    |           |      |
| wms                       |           |      |
| xlsx                      |           |      |
| xml                       |           |      |
| xsd                       |           |      |
| zip                       | (csv)     |      |
| zip                       | (gpx)     |      |
| zip                       | (shp)     |      |

The INSERT statement is:

#+NAME: sparqlend_format_insert
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX  dcat: <http://www.w3.org/ns/dcat#>
PREFIX  dct:  <http://purl.org/dc/terms/>
PREFIX  orig: <http://www.dati.gov.it/catalog/predicate/>
INSERT {
  ?harmds dcat:distribution ?dist .
  ?dist dcat:Distribution .
  ?dist dct:format ?format .
} WHERE { ?ds <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> dcat:Dataset .
    ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds .
    ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
    ?ds orig:resources ?resource .
    ?resource orig:id ?id .
    ?ds orig:format ?format
    BIND(concat(str(?harmds), "/distributions/") AS ?hds)
    BIND(iri(concat(?hds, ?id)) AS ?dist)
}
#+end_src

*** TODO mapping of the values (to a URI)

** distribution accessURL

#+NAME: sparqlend_accessURL
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?dist ?url
WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds orig:resources  ?resource. 
 ?resource orig:id ?id .
 ?resource orig:url ?url . 
 BIND(CONCAT(STR("XXXX"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_accessURL
| dist                                                    | url                                                                                             |
| XXXX/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | http://www.aci.it/fileadmin/documenti/ACI/Trasparenza/Open_Data/Open_data_annuario_2012.zip     |
| XXXX/distributions/e31bce22-1998-4cf1-b593-c0c691eb0c7d | http://www.aci.it/fileadmin/documenti/ACI/Trasparenza/Open_Data/Fringe_Benefit_2013.zip         |
| XXXX/distributions/03df43db-153f-4b81-9089-dd7e20dba312 | http://www.aci.it/fileadmin/documenti/ACI/Trasparenza/Open_Data/Open_data_Autoritratto_2011.zip |
| XXXX/distributions/e9226892-4b01-4fb1-94ff-d09a800d15d1 | http://www.aci.it/fileadmin/documenti/ACI/Trasparenza/Open_Data/Prov_categ_2012.ods             |
| XXXX/distributions/d53869c8-304f-459f-a9f5-78bc77ed5f66 | http://www.aci.it/laci/studi-e-ricerche/dati-e-statistiche/auto-trend/luglio-2013.html          |
| XXXX/distributions/88456ec6-01bb-4cd0-876e-529f601376d9 | http://www.aci.it/laci/studi-e-ricerche/dati-e-statistiche/auto-trend/agosto-2013.html          |
| XXXX/distributions/6877a032-460f-4260-9069-6f09be2f0ea5 | http://www.aci.it/laci/studi-e-ricerche/dati-e-statistiche/auto-trend/settembre-2013.html       |
| XXXX/distributions/0ba702c8-5728-4584-892f-539c621970b7 | http://www.aci.it/laci/studi-e-ricerche/dati-e-statistiche/auto-trend/gennaio-2013.html         |
| XXXX/distributions/9766a807-e8db-4bdc-ab53-a95e74de0e51 | http://www.aci.it/laci/studi-e-ricerche/dati-e-statistiche/auto-trend/febbraio-2013.html        |
| XXXX/distributions/7fd5facd-a90b-4e5a-8885-28253a1d3ca8 | http://www.aci.it/fileadmin/documenti/studi_e_ricerche/auto-trend/2013/Auto-trend0313.pdf       |

The INSERT statement is:

#+NAME: sparqlend_accessURL_insert
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX  dcat: <http://www.w3.org/ns/dcat#>
PREFIX  dct:  <http://purl.org/dc/terms/>
PREFIX  orig: <http://www.dati.gov.it/catalog/predicate/>
INSERT {
  ?harmds dcat:distribution ?dist .
  ?dist <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> dcat:Distribution .
  ?dist dct:accessURL ?url .
} WHERE { 
    ?ds a dcat:Dataset .
    ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds .
    ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
    ?ds orig:resources  ?resource . 
    ?resource orig:id ?id .
    ?resource orig:url ?url . 
    BIND(concat(str(?harmds), "/distributions/") AS ?hds)
    BIND(iri(concat(?hds, ?id)) AS ?dist)
}
#+end_src

