odip.opendatasupport.eu/mapping_queries/it.org
** distribution license

The INSERT for the license is:

#+NAME: sparqlend_format
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dcat:distribution ?dist.
 ?dist a dcat:Distribution.
 ?dist dct:license ?license.
} WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?ds orig:resource ?resource. 
 ?resource orig:id ?id.
 ?ds orig:license_id ?license. 
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
}
#+end_src

* Optional
** byte size

size not available.

** download URL

url points to a PDF

** media type

type indicates "dataset"

** release date

The INSERT for the issued date.

#+NAME: sparqlend_rdate
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
prefix dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dcat:distribution ?dist.
 ?dist a dcat:Distribution.
 ?dist dct:issued ?created.
} WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?ds orig:resources  ?resource. 
 ?resource orig:id ?id.
 ?resource orig:created ?created. 
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
}
#+end_src

** modification date

#+NAME: sparqlend_select_mdate
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT ?dist ?modified
WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds orig:resources  ?resource. 
 ?resource orig:id ?id.
 ?resource orig:revision_timestamp  ?modified.
 BIND(CONCAT(STR("harmds"),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_select_mdate
| dist                                                      | modified                   |
| harmds/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | 2013-11-28T17:38:47.657946 |
| harmds/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | 2013-11-28T17:38:47.657946 |
| harmds/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | 2013-11-28T17:38:47.657946 |
| harmds/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | 2013-11-28T17:38:47.657946 |
| harmds/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | 2013-11-28T17:38:47.657946 |
| harmds/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | 2013-11-28T17:38:47.657946 |
| harmds/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | 2013-11-28T17:38:47.657946 |
| harmds/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | 2013-11-28T17:38:47.657946 |
| harmds/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | 2013-11-28T17:38:47.657946 |
| harmds/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | 2013-11-28T17:38:47.657946 |

The INSERT is:

#+NAME: sparqlend_mdate
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
INSERT
{
 ?harmds dcat:distribution ?dist.
 ?dist a dcat:Distribution.
 ?dist dct:modified ?modified.
}
WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds orig:resources ?resource. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?resource orig:id ?id.
 ?resource orig:revision_timestamp  ?modified.
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
}
#+end_src

** rights

** status

** title

#+NAME: sparqlend_title
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dct:<http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?ds ?title
where { 
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds orig:title ?title.
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_title_select
| ds                                                                                         | title                             |
| http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_habitat                | habitat                           |
| http://www.dati.gov.it/catalog/dataset/comune-di-firenze_0261                              | DTM                               |
| http://www.dati.gov.it/catalog/dataset/comune-di-firenze_0327                              | Taxi                              |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico      | Annuario Statistico               |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_fringe-benefit           | Fringe Benefit                    |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autoritratto             | Statistiche parco veicolare       |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-2h-2013        | Auto Trend 2 Semestre 2013        |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-1h-2013        | Auto Trend 1 Semestre 2013        |
| http://www.dati.gov.it/catalog/dataset/autorita-di-bacino-del-fiume-arno_10                | Isoipse passo 100 metri           |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_localizzazione-incidenti | Localizzazione Incidenti Stradali |

#+NAME: sparqlend_title_insert
#+BEGIN_EXAMPLE
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
INSERT {
   ?harmds dct:title ?d.
} WHERE { 
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds  orig:title ?d. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. }
#+END_EXAMPLE

* Dataset properties
** Mandatory
