odip.opendatasupport.eu/mapping_queries/it.html
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> distribution license</h3>
<div class="outline-text-3" id="text-2-5">
<p>
The INSERT for the license is:
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_format">PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dcat:distribution ?dist.
 ?dist a dcat:Distribution.
 ?dist dct:license ?license.
} WHERE {
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?ds orig:resource ?resource. 
 ?resource orig:id ?id.
 ?ds orig:license_id ?license. 
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Optional</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> byte size</h3>
<div class="outline-text-3" id="text-3-1">
<p>
size not available.
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> download URL</h3>
<div class="outline-text-3" id="text-3-2">
<p>
url points to a PDF
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> media type</h3>
<div class="outline-text-3" id="text-3-3">
<p>
type indicates "dataset"
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> release date</h3>
<div class="outline-text-3" id="text-3-4">
<p>
The INSERT for the issued date.
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_rdate">PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
prefix dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dcat:distribution ?dist.
 ?dist a dcat:Distribution.
 ?dist dct:issued ?created.
} WHERE {
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?ds orig:resources  ?resource. 
 ?resource orig:id ?id.
 ?resource orig:created ?created. 
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> modification date</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_select_mdate">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
SELECT ?dist ?modified
WHERE {
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds orig:resources  ?resource. 
 ?resource orig:id ?id.
 ?resource orig:revision_timestamp  ?modified.
 BIND(CONCAT(STR("harmds"),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
} LIMIT 10
</pre>
</div>

<p>
The INSERT is:
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_mdate">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
INSERT
{
 ?harmds dcat:distribution ?dist.
 ?dist a dcat:Distribution.
 ?dist dct:modified ?modified.
}
WHERE {
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds orig:resources ?resource. 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?resource orig:id ?id.
 ?resource orig:revision_timestamp  ?modified.
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> rights</h3>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> status</h3>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> title</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_title">PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
SELECT DISTINCT ?ds ?title
where { 
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds orig:title ?title.
} LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">ds</td>
<td class="left">title</td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_habitat">http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_habitat</a></td>
<td class="left">habitat</td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/dataset/comune-di-firenze_0261">http://www.dati.gov.it/catalog/dataset/comune-di-firenze_0261</a></td>
<td class="left">DTM</td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/dataset/comune-di-firenze_0327">http://www.dati.gov.it/catalog/dataset/comune-di-firenze_0327</a></td>
<td class="left">Taxi</td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico">http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico</a></td>
<td class="left">Annuario Statistico</td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_fringe-benefit">http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_fringe-benefit</a></td>
<td class="left">Fringe Benefit</td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autoritratto">http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autoritratto</a></td>
<td class="left">Statistiche parco veicolare</td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-2h-2013">http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-2h-2013</a></td>
<td class="left">Auto Trend 2 Semestre 2013</td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-1h-2013">http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-1h-2013</a></td>
<td class="left">Auto Trend 1 Semestre 2013</td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/dataset/autorita-di-bacino-del-fiume-arno_10">http://www.dati.gov.it/catalog/dataset/autorita-di-bacino-del-fiume-arno_10</a></td>
<td class="left">Isoipse passo 100 metri</td>
</tr>

<tr>
<td class="left"><a href="http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_localizzazione-incidenti">http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_localizzazione-incidenti</a></td>
<td class="left">Localizzazione Incidenti Stradali</td>
</tr>
</tbody>
</table>

<pre class="example">
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
INSERT {
   ?harmds dct:title ?d.
} WHERE { 
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds  orig:title ?d. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. }
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Dataset properties</h2>
