odip.opendatasupport.eu/mapping_queries/it.html
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Mandatory</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Mapping description</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_description_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
SELECT DISTINCT ?ds ?description
WHERE {
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds orig:notes ?description. 
} LIMIT 10
</pre>
</div>

<pre class="example">
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
INSERT {
 ?harmds dct:description ?description
} WHERE {
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?ds a dcat:Dataset . 
 ?ds orig:notes ?description . 
}
</pre>
</div>
</div>
