odip.opendatasupport.eu/mapping_queries/it.org
*** Mapping Title
The INSERT statement is:
#+NAME: sparqlend_title_insert
#+begin_example
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dct:title ?title
} WHERE {
 ?ds a dcat:Dataset .
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?ds orig:resources ?resource.
 ?resource orig:title ?title.
}
#+end_example
** Recommended
*** Map tags to keywords

#+NAME: sparqlend_title_insert
#+begin_example
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
INSERT {
  ?harmds dcat:keyword ?name
} WHERE {
  ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?ds orig:tags ?keyword. 
  ?keyword orig:name  ?name. 
}
#+END_EXAMPLE

