odip.opendatasupport.eu/mapping_queries/it.html
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Mapping Title</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
The INSERT statement is:
</p>
<pre class="example">
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dct:title ?title
} WHERE {
 ?ds a dcat:Dataset .
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?ds orig:resources ?resource.
 ?resource orig:title ?title.
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Recommended</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Map tags to keywords</h4>
<div class="outline-text-4" id="text-4-2-1">
<pre class="example">
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
INSERT {
  ?harmds dcat:keyword ?name
} WHERE {
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?ds orig:tags ?keyword. 
  ?keyword orig:name  ?name. 
}
</pre>
</div>
</div>
