odip.opendatasupport.eu/mapping_queries/it.org
*** Mapping theme

#+NAME: sparqlend_theme_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?theme
WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset> . 
 ?ds orig:extras ?ex . 
 ?ex orig:key "tag" .
 ?ex orig:value ?theme .
} LIMIT 50
#+end_src

The INSERT Statement is:

#+NAME: sparqlend_theme_select
| theme            |              |              |                 |             |                |             |               |             |              |              |             |             |
| Terreno          | Azienda      | Allevamento  | di              | animali     | Agricoltura    |             |               |             |              |              |             |             |
| Macchinario      | Combustibile | Azienda      | Agricoltura     | Agricoltore | Agevolazione   |             |               |             |              |              |             |             |
| uso              | Agricoltura  |              |                 |             |                |             |               |             |              |              |             |             |
| Superficie       | Ettaro       | Azienda      | Agricoltura     | Agraria     |                |             |               |             |              |              |             |             |
| Titolare         | Terreno      | Sesso        | Azienda         | Allevamento | di             | animali     | Allevamento   | Agricoltura |              |              |             |             |
| Produttore       | Preparatore  | Biologico    | Azienda         | Agricoltura |                |             |               |             |              |              |             |             |
| Azienda          | Allevamento  | Agricoltura  |                 |             |                |             |               |             |              |              |             |             |
| Studenti         | Scuole       | Scuola       | Istruzione      |             |                |             |               |             |              |              |             |             |
| Studenti         | Scuole       | Scuola       | Asilo           |             |                |             |               |             |              |              |             |             |
| secondarie       | Scuole       | Scuola       | materna         | Infanzia    | Asilo          |             |               |             |              |              |             |             |
| uso              | Agricoltura  |              |                 |             |                |             |               |             |              |              |             |             |
| Studenti         | Scuole       | Scuola       | licenza         | Esami       | diploma        | Alunni      |               |             |              |              |             |             |
| Studenti         | Stranieri    | Scuole       | Scuola          | Asilo       |                |             |               |             |              |              |             |             |
| Studenti         | Stranieri    | Scuole       | Scuola          | Provenienze |                |             |               |             |              |              |             |             |
| Informazioni     | Pubblico     | Relazioni    | con             | il          | pubblico       | Scheda      | Scheda        | informativa | URP          |              |             |             |
| Turismo          | Flussi       | turistici    |                 |             |                |             |               |             |              |              |             |             |
| Turismo          | presenze     | Flussi       | turistici       | Alberghiero |                |             |               |             |              |              |             |             |
| URP              | Relazioni    | con          | il              | pubblico    | Relazioni      | Pubblico    | Pubblicazione |             |              |              |             |             |
| URP              | Relazioni    | con          | il              | pubblico    | Relazioni      | Pubblico    | Contatto      | Cittadino   |              |              |             |             |
| Turistico        | Turismo      | Provenienza  | presenze        | Flussi      | turistici      | Alberghiero |               |             |              |              |             |             |
| Imprese          | individuali  | Societa      | di              | capitale    | Natura         | giuridica   | Comuni        | Imprese     |              |              |             |             |
| URP              | Scheda       | informativa  | Scheda          | Relazioni   | con            | il          | pubblico      | Pubblico    | Informazioni |              |             |             |
| Iscrizioni       | Cessazioni   | Imprese      |                 |             |                |             |               |             |              |              |             |             |
| Turismo          | Ricettivita` | presenze     | Esercizi        | ricettivi   | Alberghiero    | Agriturismo |               |             |              |              |             |             |
| Opere            | pubbliche    | Lavori       | Lavori          | pubblici    | Edifici        | Edifici     | pubblici      | Edifici     | scolastici   |              |             |             |
| Sport            | Sicurezza    | associazioni | associazionismo | cultura     | formazione     | servizi     | pubblici      | tutela      | ambientale   |              |             |             |
| Settori          | Comuni       | Imprese      |                 |             |                |             |               |             |              |              |             |             |
| Consiglio        | Atti         | atti         | amministrativi  | consiglio   | comunale       | giunta      | comunale      | delibere    | giunta       |              |             |             |
| Consiglio        | Atti         | consiglio    | comunale        | istituzioni | giunta         | comunale    | delibere      | giunta      |              |              |             |             |
| Unione           | Fossanese    | popolazione  | famiglie        | Demografia  |                |             |               |             |              |              |             |             |
| Unione           | Fossanese    | popolazione  | Demografia      |             |                |             |               |             |              |              |             |             |
| Unione           | Fossanese    | Stato        | civile          | popolazione | eta            | Demografia  | classi        | di          | eta          |              |             |             |
| Unione           | Fossanese    | Sesso        | popolazione     | eta         | Demografia     | classi      | di            | eta         |              |              |             |             |
| Unione           | Fossanese    | Sesso        | popolazione     | Demografia  |                |             |               |             |              |              |             |             |
| Unione           | Fossanese    | Stranieri    | popolazione     | Demografia  | Area           | geografica  |               |             |              |              |             |             |
| Unione           | Fossanese    | Stranieri    | Sesso           | popolazione | nazionalita    | Demografia  |               |             |              |              |             |             |
| delibere         | giunta       | comunale     | istituzioni     | atti        | amministrativi |             |               |             |              |              |             |             |
| delibere         | istituzioni  | consiglio    | comunale        | atti        | amministrativi |             |               |             |              |              |             |             |
| trasporti        | orari        | percorsi     | Linee           | urbane      |                |             |               |             |              |              |             |             |
| Biblioteca       | Statistiche  | Iscritti     |                 |             |                |             |               |             |              |              |             |             |
| Biblioteca       | Statistiche  | prestiti     |                 |             |                |             |               |             |              |              |             |             |
| Somministrazione | Rivendita    | Ristoranti   | Esercizi        | commerciali | Esercizi       | Commercio   | Circoli       | Bevande     | Bar          | Alimenti     | Agriturismo | agriturismi |
| Rivendita        | Negozi       | Esercizi     | commerciali     | Esercizi    |                |             |               |             |              |              |             |             |
| Biblioteca       | Statistiche  | Iscritti     | domicilio       |             |                |             |               |             |              |              |             |             |
| Biblioteca       | Statistiche  | Iscritti     | professione     |             |                |             |               |             |              |              |             |             |
| Rivendita        | Esercizi     | commerciali  | Esercizi        | Edicole     |                |             |               |             |              |              |             |             |
| Rivendita        | Negozi       | Esercizi     | commerciali     | Esercizi    | Commercio      |             |               |             |              |              |             |             |
| Rivendita        | Negozi       | Generi       | di              | monopolio   | Generi         | Farmacie    | Esercizi      | commerciali | Esercizi     | Distributori | Commercio   | Carburante  |
| Rivendita        | Esercizi     | commerciali  | Esercizi        | Commercio   |                |             |               |             |              |              |             |             |
| Rivendita        | Mercato      | Mercati      | Esercizi        | Commercio   | Ambulante      |             |               |             |              |              |             |             |

