odip.opendatasupport.eu/mapping_queries/it.html
<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Mapping theme</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_theme_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
SELECT DISTINCT ?theme
WHERE {
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; . 
 ?ds orig:extras ?ex . 
 ?ex orig:key "tag" .
 ?ex orig:value ?theme .
} LIMIT 50
</pre>
</div>

<p>
The INSERT Statement is:
</p>

<table id="sparqlend_theme_select" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">theme</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">uso</td>
<td class="left">Agricoltura</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Macchinario</td>
<td class="left">Combustibile</td>
<td class="left">Azienda</td>
<td class="left">Agricoltura</td>
<td class="left">Agricoltore</td>
<td class="left">Agevolazione</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Terreno</td>
<td class="left">Azienda</td>
<td class="left">Allevamento</td>
<td class="left">di</td>
<td class="left">animali</td>
<td class="left">Agricoltura</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Superficie</td>
<td class="left">Ettaro</td>
<td class="left">Azienda</td>
<td class="left">Agricoltura</td>
<td class="left">Agraria</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Titolare</td>
<td class="left">Terreno</td>
<td class="left">Sesso</td>
<td class="left">Azienda</td>
<td class="left">Allevamento</td>
<td class="left">di</td>
<td class="left">animali</td>
<td class="left">Allevamento</td>
<td class="left">Agricoltura</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Produttore</td>
<td class="left">Preparatore</td>
<td class="left">Biologico</td>
<td class="left">Azienda</td>
<td class="left">Agricoltura</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Azienda</td>
<td class="left">Allevamento</td>
<td class="left">Agricoltura</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Studenti</td>
<td class="left">Scuole</td>
<td class="left">Scuola</td>
<td class="left">Istruzione</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Studenti</td>
<td class="left">Scuole</td>
<td class="left">Scuola</td>
<td class="left">Asilo</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">secondarie</td>
<td class="left">Scuole</td>
<td class="left">Scuola</td>
<td class="left">materna</td>
<td class="left">Infanzia</td>
<td class="left">Asilo</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">uso</td>
<td class="left">Agricoltura</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Studenti</td>
<td class="left">Stranieri</td>
<td class="left">Scuole</td>
<td class="left">Scuola</td>
<td class="left">Asilo</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Studenti</td>
<td class="left">Scuole</td>
<td class="left">Scuola</td>
<td class="left">licenza</td>
<td class="left">Esami</td>
<td class="left">diploma</td>
<td class="left">Alunni</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Studenti</td>
<td class="left">Stranieri</td>
<td class="left">Scuole</td>
<td class="left">Scuola</td>
<td class="left">Provenienze</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informazioni</td>
<td class="left">Pubblico</td>
<td class="left">Relazioni</td>
<td class="left">con</td>
<td class="left">il</td>
<td class="left">pubblico</td>
<td class="left">Scheda</td>
<td class="left">Scheda</td>
<td class="left">informativa</td>
<td class="left">URP</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Turismo</td>
<td class="left">Flussi</td>
<td class="left">turistici</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">URP</td>
<td class="left">Relazioni</td>
<td class="left">con</td>
<td class="left">il</td>
<td class="left">pubblico</td>
<td class="left">Relazioni</td>
<td class="left">Pubblico</td>
<td class="left">Contatto</td>
<td class="left">Cittadino</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Turismo</td>
<td class="left">presenze</td>
<td class="left">Flussi</td>
<td class="left">turistici</td>
<td class="left">Alberghiero</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">URP</td>
<td class="left">Relazioni</td>
<td class="left">con</td>
<td class="left">il</td>
<td class="left">pubblico</td>
<td class="left">Relazioni</td>
<td class="left">Pubblico</td>
<td class="left">Pubblicazione</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">URP</td>
<td class="left">Scheda</td>
<td class="left">informativa</td>
<td class="left">Scheda</td>
<td class="left">Relazioni</td>
<td class="left">con</td>
<td class="left">il</td>
<td class="left">pubblico</td>
<td class="left">Pubblico</td>
<td class="left">Informazioni</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Turistico</td>
<td class="left">Turismo</td>
<td class="left">Provenienza</td>
<td class="left">presenze</td>
<td class="left">Flussi</td>
<td class="left">turistici</td>
<td class="left">Alberghiero</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Turismo</td>
<td class="left">Ricettivita`</td>
<td class="left">presenze</td>
<td class="left">Esercizi</td>
<td class="left">ricettivi</td>
<td class="left">Alberghiero</td>
<td class="left">Agriturismo</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Iscrizioni</td>
<td class="left">Cessazioni</td>
<td class="left">Imprese</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Imprese</td>
<td class="left">individuali</td>
<td class="left">Societa</td>
<td class="left">di</td>
<td class="left">capitale</td>
<td class="left">Natura</td>
<td class="left">giuridica</td>
<td class="left">Comuni</td>
<td class="left">Imprese</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Settori</td>
<td class="left">Comuni</td>
<td class="left">Imprese</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Opere</td>
<td class="left">pubbliche</td>
<td class="left">Lavori</td>
<td class="left">Lavori</td>
<td class="left">pubblici</td>
<td class="left">Edifici</td>
<td class="left">Edifici</td>
<td class="left">pubblici</td>
<td class="left">Edifici</td>
<td class="left">scolastici</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Sport</td>
<td class="left">Sicurezza</td>
<td class="left">associazioni</td>
<td class="left">associazionismo</td>
<td class="left">cultura</td>
<td class="left">formazione</td>
<td class="left">servizi</td>
<td class="left">pubblici</td>
<td class="left">tutela</td>
<td class="left">ambientale</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Consiglio</td>
<td class="left">Atti</td>
<td class="left">consiglio</td>
<td class="left">comunale</td>
<td class="left">istituzioni</td>
<td class="left">giunta</td>
<td class="left">comunale</td>
<td class="left">delibere</td>
<td class="left">giunta</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Consiglio</td>
<td class="left">Atti</td>
<td class="left">atti</td>
<td class="left">amministrativi</td>
<td class="left">consiglio</td>
<td class="left">comunale</td>
<td class="left">giunta</td>
<td class="left">comunale</td>
<td class="left">delibere</td>
<td class="left">giunta</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Unione</td>
<td class="left">Fossanese</td>
<td class="left">popolazione</td>
<td class="left">Demografia</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Unione</td>
<td class="left">Fossanese</td>
<td class="left">popolazione</td>
<td class="left">famiglie</td>
<td class="left">Demografia</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Unione</td>
<td class="left">Fossanese</td>
<td class="left">Sesso</td>
<td class="left">popolazione</td>
<td class="left">eta</td>
<td class="left">Demografia</td>
<td class="left">classi</td>
<td class="left">di</td>
<td class="left">eta</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Unione</td>
<td class="left">Fossanese</td>
<td class="left">Stato</td>
<td class="left">civile</td>
<td class="left">popolazione</td>
<td class="left">eta</td>
<td class="left">Demografia</td>
<td class="left">classi</td>
<td class="left">di</td>
<td class="left">eta</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Unione</td>
<td class="left">Fossanese</td>
<td class="left">Sesso</td>
<td class="left">popolazione</td>
<td class="left">Demografia</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Unione</td>
<td class="left">Fossanese</td>
<td class="left">Stranieri</td>
<td class="left">popolazione</td>
<td class="left">Demografia</td>
<td class="left">Area</td>
<td class="left">geografica</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Unione</td>
<td class="left">Fossanese</td>
<td class="left">Stranieri</td>
<td class="left">Sesso</td>
<td class="left">popolazione</td>
<td class="left">nazionalita</td>
<td class="left">Demografia</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">delibere</td>
<td class="left">istituzioni</td>
<td class="left">consiglio</td>
<td class="left">comunale</td>
<td class="left">atti</td>
<td class="left">amministrativi</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">delibere</td>
<td class="left">giunta</td>
<td class="left">comunale</td>
<td class="left">istituzioni</td>
<td class="left">atti</td>
<td class="left">amministrativi</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">trasporti</td>
<td class="left">orari</td>
<td class="left">percorsi</td>
<td class="left">Linee</td>
<td class="left">urbane</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Biblioteca</td>
<td class="left">Statistiche</td>
<td class="left">Iscritti</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Biblioteca</td>
<td class="left">Statistiche</td>
<td class="left">Iscritti</td>
<td class="left">domicilio</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Biblioteca</td>
<td class="left">Statistiche</td>
<td class="left">Iscritti</td>
<td class="left">professione</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Biblioteca</td>
<td class="left">Statistiche</td>
<td class="left">prestiti</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Rivendita</td>
<td class="left">Negozi</td>
<td class="left">Esercizi</td>
<td class="left">commerciali</td>
<td class="left">Esercizi</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Somministrazione</td>
<td class="left">Rivendita</td>
<td class="left">Ristoranti</td>
<td class="left">Esercizi</td>
<td class="left">commerciali</td>
<td class="left">Esercizi</td>
<td class="left">Commercio</td>
<td class="left">Circoli</td>
<td class="left">Bevande</td>
<td class="left">Bar</td>
<td class="left">Alimenti</td>
<td class="left">Agriturismo</td>
<td class="left">agriturismi</td>
</tr>

<tr>
<td class="left">Rivendita</td>
<td class="left">Esercizi</td>
<td class="left">commerciali</td>
<td class="left">Esercizi</td>
<td class="left">Edicole</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Rivendita</td>
<td class="left">Esercizi</td>
<td class="left">commerciali</td>
<td class="left">Esercizi</td>
<td class="left">Commercio</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Rivendita</td>
<td class="left">Negozi</td>
<td class="left">Generi</td>
<td class="left">di</td>
<td class="left">monopolio</td>
<td class="left">Generi</td>
<td class="left">Farmacie</td>
<td class="left">Esercizi</td>
<td class="left">commerciali</td>
<td class="left">Esercizi</td>
<td class="left">Distributori</td>
<td class="left">Commercio</td>
<td class="left">Carburante</td>
</tr>

<tr>
<td class="left">Rivendita</td>
<td class="left">Negozi</td>
<td class="left">Esercizi</td>
<td class="left">commerciali</td>
<td class="left">Esercizi</td>
<td class="left">Commercio</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Rivendita</td>
<td class="left">Mercato</td>
<td class="left">Mercati</td>
<td class="left">Esercizi</td>
<td class="left">Commercio</td>
<td class="left">Ambulante</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
