odip.opendatasupport.eu/mapping_queries/it.org
*** Mapping contactPoint email

#+NAME: sparqlend_email_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX  orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX  dct: <http://purl.org/dc/terms/> 
PREFIX  adms: <http://www.w3.org/ns/adms#>
SELECT DISTINCT ?ds ?cPoint ?emailTo
WHERE { 
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds orig:maintainer_email ?email. 
 BIND (IRI(CONCAT(?ds,"/contactPoint")) AS ?cPoint).
 BIND (IRI(CONCAT("mailto:",?email)) AS ?emailTo)
} LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_email_select
| ds                                                                                        | cPoint                                                                                                 | emailTo                                   |
| http://www.dati.gov.it/catalog/dataset/comune-di-bari_aree-verdi                          | http://www.dati.gov.it/catalog/dataset/comune-di-bari_aree-verdi/contactPoint                          | mailto:rip.infrastrutture@comune.bari.it  |
| http://www.dati.gov.it/catalog/dataset/comune-di-bari_scuole-del-comune-di-bari           | http://www.dati.gov.it/catalog/dataset/comune-di-bari_scuole-del-comune-di-bari/contactPoint           | mailto:rip.infrastrutture@comune.bari.it  |
| http://www.dati.gov.it/catalog/dataset/comune-di-bari_artisti-di-strada-e-writers         | http://www.dati.gov.it/catalog/dataset/comune-di-bari_artisti-di-strada-e-writers/contactPoint         | mailto:rip.culturaesport@comune.bari.it   |
| http://www.dati.gov.it/catalog/dataset/comune-di-bari_associazioni-culturali              | http://www.dati.gov.it/catalog/dataset/comune-di-bari_associazioni-culturali/contactPoint              | mailto:rip.culturaesport@comune.bari.it   |
| http://www.dati.gov.it/catalog/dataset/comune-di-bari_guide-turistiche-del-comune-di-bari | http://www.dati.gov.it/catalog/dataset/comune-di-bari_guide-turistiche-del-comune-di-bari/contactPoint | mailto:rip.culturaesport@comune.bari.it   |
| http://www.dati.gov.it/catalog/dataset/comune-di-bari_cassonetti-amiu                     | http://www.dati.gov.it/catalog/dataset/comune-di-bari_cassonetti-amiu/contactPoint                     | mailto:rip.igieneeambiente@comune.bari.it |
| http://www.dati.gov.it/catalog/dataset/comune-di-bari_cimiteri                            | http://www.dati.gov.it/catalog/dataset/comune-di-bari_cimiteri/contactPoint                            | mailto:rip.igieneeambiente@comune.bari.it |
| http://www.dati.gov.it/catalog/dataset/comune-di-bari_circoscrizioni                      | http://www.dati.gov.it/catalog/dataset/comune-di-bari_circoscrizioni/contactPoint                      | mailto:rip.igieneeambiente@comune.bari.it |
| http://www.dati.gov.it/catalog/dataset/comune-di-bari_edifici-sensibile                   | http://www.dati.gov.it/catalog/dataset/comune-di-bari_edifici-sensibile/contactPoint                   | mailto:rip.igieneeambiente@comune.bari.it |
| http://www.dati.gov.it/catalog/dataset/comune-di-bari_farmacie                            | http://www.dati.gov.it/catalog/dataset/comune-di-bari_farmacie/contactPoint                            | mailto:rip.igieneeambiente@comune.bari.it |

The INSERT statement is:

#+NAME: sparqlend_email_insert
#+begin_example
PREFIX  orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX  adms: <http://www.w3.org/ns/adms#>
INSERT { 
  ?ds adms:contactPoint ?cPoint.
  ?cPoint a <http://www.w3.org/2006/vcard/ns#VCard>.
  ?cPoint <http://www.w3.org/2006/vcard/ns#email>  ?emailTo
} WHERE { 
  ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
  ?ds orig:maintainer_email ?email. 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
  BIND (IRI(CONCAT(?ds,"/contactPoint")) AS ?cPoint).
  BIND (IRI(CONCAT("mailto:",?email)) AS ?emailTo)
}
#+end_example

*** Mapping contactPoint name

The INSERT statement is:

#+NAME: sparqlend_title_insert
#+begin_example
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX adms: <http://www.w3.org/ns/adms#>
INSERT { 
  ?ds adms:contactPoint ?cPoint.
  ?cPoint a <http://www.w3.org/2006/vcard/ns#VCard>.
  ?cPoint <http://www.w3.org/2006/vcard/ns#fn>  ?name
} WHERE { 
  ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
  ?ds orig:maintainer ?name. 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
  BIND (IRI(CONCAT(?ds,"/contactPoint")) AS ?cPoint)
}
#+END_EXAMPLE

*** Mapping publisher

#+NAME: sparqlend_publisher_select
#+BEGIN_SRC roqet :endpoint http://192.168.33.33/sparql
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX dct:<http://purl.org/dc/terms/> 
SELECT ?publisher ?ds 
WHERE {
  ?ds a <http://www.w3.org/ns/dcat#Dataset> . 
  ?ds orig:author ?publisher .
} LIMIT 10
#+END_SRC

The INSERT statement is:

#+NAME: sparqlend_publisher_insert
#+BEGIN_EXAMPLE
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX dct:<http://purl.org/dc/terms/> 
INSERT { 
  ?harmds dct:publisher ?publisher
} WHERE { 
  ?ds a <http://www.w3.org/ns/dcat#Dataset> . 
  ?ds orig:author ?publisher .
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
}
#+END_EXAMPLE

** Optional
*** TODO dataset conformsTo (dct:conformsTo)
    
*** TODO dataset frequency (dct:accrualPeriodicity)

*** TODO dataset identifier (dct:identifier)

#+NAME: sparqlend_select_name
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?name
WHERE {
  ?ds a <http://www.w3.org/ns/dcat#Dataset> .
  ?ds orig:name ?name .
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_select_name
| name                                                |
| aci-automobile-club-italia_annuario-statistico      |
| aci-automobile-club-italia_fringe-benefit           |
| aci-automobile-club-italia_autoritratto             |
| aci-automobile-club-italia_autotrend-2h-2013        |
| aci-automobile-club-italia_autotrend-1h-2013        |
| autorita-di-bacino-del-fiume-arno_10                |
| aci-automobile-club-italia_localizzazione-incidenti |
| autorita-di-bacino-del-fiume-arno_1048              |
| autorita-di-bacino-del-fiume-arno_1056              |
| autorita-di-bacino-del-fiume-arno_1049              |

The identifier INSERT statement:

#+NAME: sparqlend_name_insert
#+begin_example
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX adms: <http://www.w3.org/ns/adms#> 
INSERT { 
 ?harmds adms:identifier ?name .
} WHERE { 
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?ds  orig:name ?name 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
}
#+END_EXAMPLE

