odip.opendatasupport.eu/mapping_queries/it.html
<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> Mapping contactPoint email</h4>
<div class="outline-text-4" id="text-4-2-3">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_email_select">PREFIX  orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX  dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX  adms: &lt;http://www.w3.org/ns/adms#&gt;
SELECT DISTINCT ?ds ?cPoint ?emailTo
WHERE { 
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds orig:maintainer_email ?email. 
 BIND (IRI(CONCAT(?ds,"/contactPoint")) AS ?cPoint).
 BIND (IRI(CONCAT("mailto:",?email)) AS ?emailTo)
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>

<pre class="example">
PREFIX  orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX  adms: &lt;http://www.w3.org/ns/adms#&gt;
INSERT { 
  ?ds adms:contactPoint ?cPoint.
  ?cPoint a &lt;http://www.w3.org/2006/vcard/ns#VCard&gt;.
  ?cPoint &lt;http://www.w3.org/2006/vcard/ns#email&gt;  ?emailTo
} WHERE { 
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
  ?ds orig:maintainer_email ?email. 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
  BIND (IRI(CONCAT(?ds,"/contactPoint")) AS ?cPoint).
  BIND (IRI(CONCAT("mailto:",?email)) AS ?emailTo)
}
</pre>
</div>
</div>
<div id="outline-container-sec-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="section-number-4">4.2.4</span> Mapping contactPoint name</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
The INSERT statement is:
</p>

<pre class="example">
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX adms: &lt;http://www.w3.org/ns/adms#&gt;
INSERT { 
  ?ds adms:contactPoint ?cPoint.
  ?cPoint a &lt;http://www.w3.org/2006/vcard/ns#VCard&gt;.
  ?cPoint &lt;http://www.w3.org/2006/vcard/ns#fn&gt;  ?name
} WHERE { 
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
  ?ds orig:maintainer ?name. 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
  BIND (IRI(CONCAT(?ds,"/contactPoint")) AS ?cPoint)
}
</pre>
</div>
</div>
<div id="outline-container-sec-4-2-5" class="outline-4">
<h4 id="sec-4-2-5"><span class="section-number-4">4.2.5</span> Mapping publisher</h4>
<div class="outline-text-4" id="text-4-2-5">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_publisher_select">PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
SELECT ?publisher ?ds 
WHERE {
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; . 
  ?ds orig:author ?publisher .
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>

<pre class="example">
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
INSERT { 
  ?harmds dct:publisher ?publisher
} WHERE { 
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; . 
  ?ds orig:author ?publisher .
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Optional</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> <span class="todo TODO">TODO</span> dataset conformsTo (dct:conformsTo)</h4>
</div>

<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> <span class="todo TODO">TODO</span> dataset frequency (dct:accrualPeriodicity)</h4>
</div>

<div id="outline-container-sec-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> <span class="todo TODO">TODO</span> dataset identifier (dct:identifier)</h4>
<div class="outline-text-4" id="text-4-3-3">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_select_name">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
SELECT DISTINCT ?name
WHERE {
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; .
  ?ds orig:name ?name .
} LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">name</td>
</tr>

<tr>
<td class="left">aci-automobile-club-italia<sub>annuario</sub>-statistico</td>
</tr>

<tr>
<td class="left">aci-automobile-club-italia<sub>autoritratto</sub></td>
</tr>

<tr>
<td class="left">aci-automobile-club-italia<sub>autotrend</sub>-1h-2013</td>
</tr>

<tr>
<td class="left">aci-automobile-club-italia<sub>autotrend</sub>-2h-2013</td>
</tr>

<tr>
<td class="left">aci-automobile-club-italia<sub>fringe</sub>-benefit</td>
</tr>

<tr>
<td class="left">aci-automobile-club-italia<sub>localizzazione</sub>-incidenti</td>
</tr>

<tr>
<td class="left">autorita-di-bacino-del-fiume-arno<sub>10</sub></td>
</tr>

<tr>
<td class="left">autorita-di-bacino-del-fiume-arno<sub>1048</sub></td>
</tr>

<tr>
<td class="left">autorita-di-bacino-del-fiume-arno<sub>1049</sub></td>
</tr>

<tr>
<td class="left">autorita-di-bacino-del-fiume-arno<sub>1056</sub></td>
</tr>
</tbody>
</table>

<p>
The identifier INSERT statement:
</p>

<pre class="example">
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX adms: &lt;http://www.w3.org/ns/adms#&gt; 
INSERT { 
 ?harmds adms:identifier ?name .
} WHERE { 
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?ds  orig:name ?name 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
}
</pre>
</div>
</div>
