odip.opendatasupport.eu/mapping_queries/it.org
*** dataset landing page (dcat:landingPage)

#+NAME: sparqlend_landingPage_name
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?dist ?ds
WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds orig:resources ?resource. 
 ?resource orig:id ?id.
 BIND(CONCAT(STR("XXX"),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_landingPage_name
| dist                                                   | ds                                                                                    |
| XXX/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico |
| XXX/distributions/e31bce22-1998-4cf1-b593-c0c691eb0c7d | http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_fringe-benefit      |
| XXX/distributions/03df43db-153f-4b81-9089-dd7e20dba312 | http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autoritratto        |
| XXX/distributions/e9226892-4b01-4fb1-94ff-d09a800d15d1 | http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autoritratto        |
| XXX/distributions/d53869c8-304f-459f-a9f5-78bc77ed5f66 | http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-2h-2013   |
| XXX/distributions/88456ec6-01bb-4cd0-876e-529f601376d9 | http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-2h-2013   |
| XXX/distributions/6877a032-460f-4260-9069-6f09be2f0ea5 | http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-2h-2013   |
| XXX/distributions/0ba702c8-5728-4584-892f-539c621970b7 | http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-1h-2013   |
| XXX/distributions/9766a807-e8db-4bdc-ab53-a95e74de0e51 | http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-1h-2013   |
| XXX/distributions/7fd5facd-a90b-4e5a-8885-28253a1d3ca8 | http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_autotrend-1h-2013   |

For the landingPage INSERT:

#+NAME: sparqlend_landingpage_insert
#+begin_example
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
INSERT
{
 ?harmds dcat:distribution ?dist.
 ?dist a dcat:Distribution.
 ?dist dcat:landingPage ?ds.
}
WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds orig:resources ?resource. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?resource orig:id ?id.
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,?id)) AS ?dist).
}
#+end_example

*** TODO dataset language (dct:language)
*** TODO dataset other identifier (adms:identifier)
what is the difference between this and the other dct:identifier?

*** dataset release date (dct:issued)

#+NAME: sparqlend_dsissued_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX  orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX  dct: <http://purl.org/dc/terms/> 
SELECT ?ds ?issued
WHERE {
?ds a <http://www.w3.org/ns/dcat#Dataset>. 
?ds orig:metadata_created ?issued. 
} LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_dsissued_select
| ds                                                                                    | issued                     |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico | 2013-09-16T11:28:14.506893 |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico | 2013-09-16T11:28:14.506893 |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico | 2013-09-16T11:28:14.506893 |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico | 2013-09-16T11:28:14.506893 |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico | 2013-09-16T11:28:14.506893 |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico | 2013-09-16T11:28:14.506893 |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico | 2013-09-16T11:28:14.506893 |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico | 2013-09-16T11:28:14.506893 |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_annuario-statistico | 2013-09-16T11:28:14.506893 |
| http://www.dati.gov.it/catalog/dataset/aci-automobile-club-italia_fringe-benefit      | 2013-09-16T11:27:32.930373 |

#+NAME: sparqlend_title_insert
#+begin_example
PREFIX  orig: <http://www.dati.gov.it/catalog/predicate/> 
prefix dct:<http://purl.org/dc/terms/> 
INSERT
{
?harmds dct:issued ?issued
}
WHERE {
?ds a <http://www.w3.org/ns/dcat#Dataset>. 
?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
?ds orig:tags ?keyword. 
?keyword orig:metadata_created ?issued. 
}
#+END_EXAMPLE

*** dataset modification date (dct:modified)

#+NAME: sparqlend_dsmodified_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX  orig: <http://www.dati.gov.it/catalog/predicate/> 
prefix dct:<http://purl.org/dc/terms/> 
SELECT ?ds ?modified
WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset> . 
 ?ds orig:metadata_modified ?modified .
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_dsmodified_select
| ds                                                                                  | modified                   |
| http://www.dati.gov.it/catalog/dataset/beni-confiscati-alla-criminalita-organizzata | 2013-09-24T12:00:50.657436 |
| http://www.dati.gov.it/catalog/dataset/beni-confiscati-alla-criminalita-organizzata | 2013-09-24T12:00:50.657436 |
| http://www.dati.gov.it/catalog/dataset/beni-confiscati-alla-criminalita-organizzata | 2013-09-24T12:00:50.657436 |
| http://www.dati.gov.it/catalog/dataset/comune-di-napoli_22341                       | 2013-09-24T12:00:50.657436 |
| http://www.dati.gov.it/catalog/dataset/comune-di-napoli_22341                       | 2013-09-24T12:00:50.657436 |
| http://www.dati.gov.it/catalog/dataset/comune-di-napoli_22341                       | 2013-09-24T12:00:50.657436 |
| http://www.dati.gov.it/catalog/dataset/comune-di-napoli_22343                       | 2013-09-24T12:00:50.657436 |
| http://www.dati.gov.it/catalog/dataset/comune-di-napoli_22343                       | 2013-09-24T12:00:50.657436 |
| http://www.dati.gov.it/catalog/dataset/comune-di-napoli_22343                       | 2013-09-24T12:00:50.657436 |
| http://www.dati.gov.it/catalog/dataset/comune-di-napoli_22344                       | 2013-09-24T12:00:50.657436 |

#+NAME: sparqlend_title_insert
#+BEGIN_EXAMPLE
PREFIX  orig: <http://www.dati.gov.it/catalog/predicate/> 
prefix dct:<http://purl.org/dc/terms/> 
INSERT {
 ?harmds dct:modified ?modified
} WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?ds orig:tags ?keyword. 
 ?keyword orig:metadata_modified ?modified. 
}
#+END_EXAMPLE

*** TODO dataset spatial/geographic (dct:spatial)

Info not found (possibly a key) geo-name/geo-value could be possibles

*** TODO dataset temporal (dct:temporal)

Info not found

