odip.opendatasupport.eu/mapping_queries/it.org
*** dataset version

#+NAME: sparqlend_version_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX adms: <http://www.w3.org/ns/adms#> 
SELECT ?version ?ds 
WHERE { 
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds orig:version  ?version . 
} LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_version_select
| version | ds                                                                                                                                 |
|       1 | http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_riassunto-rilievo-traffico-automatico-stazioni-fisse-anno-2005 |
|       1 | http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_riassunto-rilievo-traffico-automatico-stazioni-fisse-anno-2005 |
|       1 | http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_riassunto-rilievo-traffico-automatico-stazioni-fisse-anno-2006 |
|       1 | http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_riassunto-rilievo-traffico-automatico-stazioni-fisse-anno-2006 |
|       1 | http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_riassunto-rilievo-traffico-automatico-stazioni-fisse-anno-2007 |
|       1 | http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_riassunto-rilievo-traffico-automatico-stazioni-fisse-anno-2007 |
|       1 | http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_riassunto-rilievo-traffico-automatico-stazioni-fisse-anno-2008 |
|       1 | http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_riassunto-rilievo-traffico-automatico-stazioni-fisse-anno-2008 |
|       1 | http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_riassunto-rilievo-traffico-automatico-stazioni-fisse-anno-2009 |
|       1 | http://www.dati.gov.it/catalog/dataset/provincia-autonoma-di-trento_riassunto-rilievo-traffico-automatico-stazioni-fisse-anno-2009 |

#+NAME: sparqlend_version_insert
#+begin_example
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX adms: <http://www.w3.org/ns/adms#> 
INSERT { 
 ?harmds adms:version ?d .
} WHERE { 
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds  orig:version  ?d. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
}
#+END_EXAMPLE

*** TODO dataset version notes (adms:versionNotes)

*** dataset status

#+NAME: sparqlend_select_status
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?state
WHERE {
  ?ds a <http://www.w3.org/ns/dcat#Dataset> .
  ?ds orig:state ?state .
} LIMIT 10
#+end_src

The setting of the status value (INSERT statement):

#+NAME: sparqlend_version_insert
#+begin_example
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
PREFIX adms: <http://www.w3.org/ns/adms#> 
INSERT { 
 ?harmds adms:status ?state .
} WHERE { 
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?ds  orig:state ?state 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
}
#+END_EXAMPLE

*** Extras

#+NAME: sparqlend_select_status
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://www.dati.gov.it/catalog/predicate/> 
SELECT DISTINCT ?state
WHERE {
  ?ds a <http://www.w3.org/ns/dcat#Dataset> .
  ?ds orig:theme ?state .
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_select_status
: state

* Value Mapping

http://publications.europa.eu/resource/authority/file-type

#+NAME: sparqlend_select_concept
#+begin_src roqet :endpoint http://192.168.33.33/sparql
select distinct ?concept
FROM <http://publications.europa.eu/resource/authority/file-type>
WHERE {
  ?concept a <http://www.w3.org/2004/02/skos/core#Concept>
} ORDER BY ?concept
#+end_src

| concept                                                               | current |
|-----------------------------------------------------------------------+---------|
| http://publications.europa.eu/resource/authority/file-type/AZW        |         |
| http://publications.europa.eu/resource/authority/file-type/CSV        | yes     |
| http://publications.europa.eu/resource/authority/file-type/DBF        |         |
| http://publications.europa.eu/resource/authority/file-type/DOC        | yes     |
| http://publications.europa.eu/resource/authority/file-type/DOCX       |         |
| http://publications.europa.eu/resource/authority/file-type/E00        |         |
| http://publications.europa.eu/resource/authority/file-type/EPUB       |         |
| http://publications.europa.eu/resource/authority/file-type/FMX2       |         |
| http://publications.europa.eu/resource/authority/file-type/FMX3       |         |
| http://publications.europa.eu/resource/authority/file-type/FMX4       |         |
| http://publications.europa.eu/resource/authority/file-type/GIF        |         |
| http://publications.europa.eu/resource/authority/file-type/GZIP       |         |
| http://publications.europa.eu/resource/authority/file-type/HTML       | yes     |
| http://publications.europa.eu/resource/authority/file-type/JPEG       |         |
| http://publications.europa.eu/resource/authority/file-type/JSON       |         |
| http://publications.europa.eu/resource/authority/file-type/KML        |         |
| http://publications.europa.eu/resource/authority/file-type/MDB        |         |
| http://publications.europa.eu/resource/authority/file-type/MOBI       |         |
| http://publications.europa.eu/resource/authority/file-type/MOP        |         |
| http://publications.europa.eu/resource/authority/file-type/MXD        |         |
| http://publications.europa.eu/resource/authority/file-type/OP_DATPRO  |         |
| http://publications.europa.eu/resource/authority/file-type/PDF        | yes     |
| http://publications.europa.eu/resource/authority/file-type/PDFA1A     |         |
| http://publications.europa.eu/resource/authority/file-type/PDFA1B     |         |
| http://publications.europa.eu/resource/authority/file-type/PDFX       |         |
| http://publications.europa.eu/resource/authority/file-type/PNG        |         |
| http://publications.europa.eu/resource/authority/file-type/PPSX       |         |
| http://publications.europa.eu/resource/authority/file-type/PPT        |         |
| http://publications.europa.eu/resource/authority/file-type/PPTX       |         |
| http://publications.europa.eu/resource/authority/file-type/RDF_XML    |         |
| http://publications.europa.eu/resource/authority/file-type/RTF        | yes     |
| http://publications.europa.eu/resource/authority/file-type/SGML       |         |
| http://publications.europa.eu/resource/authority/file-type/SKOS_XML   |         |
| http://publications.europa.eu/resource/authority/file-type/SPARQLQ    |         |
| http://publications.europa.eu/resource/authority/file-type/SPARQLQRES |         |
| http://publications.europa.eu/resource/authority/file-type/TIFF       |         |
| http://publications.europa.eu/resource/authority/file-type/TSV        |         |
| http://publications.europa.eu/resource/authority/file-type/TXT        |         |
| http://publications.europa.eu/resource/authority/file-type/XHTML      |         |
| http://publications.europa.eu/resource/authority/file-type/XLS        |         |
| http://publications.europa.eu/resource/authority/file-type/XLSX       |         |
| http://publications.europa.eu/resource/authority/file-type/XML        | yes     |
| http://publications.europa.eu/resource/authority/file-type/XSLT       |         |
| http://publications.europa.eu/resource/authority/file-type/ZIP        | yes     |

