odip.opendatasupport.eu/mapping_queries/it.html
<div id="outline-container-sec-4-3-11" class="outline-4">
<h4 id="sec-4-3-11"><span class="section-number-4">4.3.11</span> dataset version</h4>
<div class="outline-text-4" id="text-4-3-11">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_version_select">PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX adms: &lt;http://www.w3.org/ns/adms#&gt; 
SELECT ?version ?ds 
WHERE { 
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds orig:version  ?version . 
} LIMIT 10
</pre>
</div>

<pre class="example">
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX adms: &lt;http://www.w3.org/ns/adms#&gt; 
INSERT { 
 ?harmds adms:version ?d .
} WHERE { 
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds  orig:version  ?d. 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
}
</pre>
</div>
</div>
<div id="outline-container-sec-4-3-12" class="outline-4">
<h4 id="sec-4-3-12"><span class="section-number-4">4.3.12</span> <span class="todo TODO">TODO</span> dataset version notes (adms:versionNotes)</h4>
</div>

<div id="outline-container-sec-4-3-13" class="outline-4">
<h4 id="sec-4-3-13"><span class="section-number-4">4.3.13</span> dataset status</h4>
<div class="outline-text-4" id="text-4-3-13">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_select_status">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
SELECT DISTINCT ?state
WHERE {
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; .
  ?ds orig:state ?state .
} LIMIT 10
</pre>
</div>

<p>
The setting of the status value (INSERT statement):
</p>

<pre class="example">
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
PREFIX adms: &lt;http://www.w3.org/ns/adms#&gt; 
INSERT { 
 ?harmds adms:status ?state .
} WHERE { 
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?ds  orig:state ?state 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
}
</pre>
</div>
</div>
<div id="outline-container-sec-4-3-14" class="outline-4">
<h4 id="sec-4-3-14"><span class="section-number-4">4.3.14</span> Extras</h4>
<div class="outline-text-4" id="text-4-3-14">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_select_status">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://www.dati.gov.it/catalog/predicate/&gt; 
SELECT DISTINCT ?state
WHERE {
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; .
  ?ds orig:theme ?state .
} LIMIT 10
</pre>
</div>
</div>
</div>
</div>
</div>
